In [2]:
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
data = [10, 20, 30, 40]#1. Series - Pandas এর ১D array,
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Delhi', 'Mumbai', 'Kolkata']
}
#2. DataFrame - ২D টেবুলার ডেটা স্ট্রাকচার
df = pd.DataFrame(data)
print(df)
s = pd.Series(data)
print(s)

      Name  Age     City
0    Alice   25    Delhi
1      Bob   30   Mumbai
2  Charlie   35  Kolkata
Name       [Alice, Bob, Charlie]
Age                 [25, 30, 35]
City    [Delhi, Mumbai, Kolkata]
dtype: object

In [8]:
# ডেটা ফিল্টার করা
print("------------Age greater than 28-------------")
print(df[df['Age'] > 28])
print("-------------------------")
# নতুন কলাম যোগ করা
print("------------Age in 5 years -------------")
df['Age_in_5_years'] = df['Age'] + 5
print(df)
print("-------------------------")
# কলাম ডিলিট করা
print("------------delete-------------")
df = df.drop('Age_in_5_years', axis=1)
print("-------------------------")
# গ্রুপ বাই করা
print("-----------column wise sort to calculate mean -------------")
print(df.groupby('City')['Age'].mean())
print("-------------------------")
# ডেটা ফিল্টার করা
print(df[df['Age'] > 28])
print("-------------------------")
# নতুন কলাম যোগ করা
df['Age_in_5_years'] = df['Age'] + 5
print(df)
print("-------------------------")
# কলাম ডিলিট করা
df = df.drop('Age_in_5_years', axis=1)
print("-------------------------")
# গ্রুপ বাই করা
print(df.groupby('City')['Age'].mean())

------------Age greater than 28-------------
      Name  Age     City
1      Bob   30   Mumbai
2  Charlie   35  Kolkata
-------------------------
------------Age in 5 years -------------
      Name  Age     City  Age_in_5_years
0    Alice   25    Delhi              30
1      Bob   30   Mumbai              35
2  Charlie   35  Kolkata              40
-------------------------
------------delete-------------
-------------------------
-----------column wise sort to calculate mean -------------
City
Delhi      25.0
Kolkata    35.0
Mumbai     30.0
Name: Age, dtype: float64
-------------------------
      Name  Age     City
1      Bob   30   Mumbai
2  Charlie   35  Kolkata
-------------------------
      Name  Age     City  Age_in_5_years
0    Alice   25    Delhi              30
1      Bob   30   Mumbai              35
2  Charlie   35  Kolkata              40
-------------------------
-------------------------
City
Delhi      25.0
Kolkata    35.0
Mumbai     30.0
Name: Age, dtype: float64

In [9]:
print(df.shape)

(3, 3)

In [10]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

In [11]:
print(df['Name'])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [12]:
df2 = pd.DataFrame({
    'Name': ['Raju', 'Mina', 'Raju'],
    'Age': [23, 27, 23]
})

print("Before dropping duplicates:")
print(df2)

df2 = df2.drop_duplicates()
print("\nAfter dropping duplicates:")
print(df2)

Before dropping duplicates:
   Name  Age
0  Raju   23
1  Mina   27
2  Raju   23

After dropping duplicates:
   Name  Age
0  Raju   23
1  Mina   27

In [14]:
df3 = pd.DataFrame({
    'Name': ['Raju', None, 'Mina'],
    'Age': [23, 25, None]
})

print(df3.isnull())

    Name    Age
0  False  False
1   True  False
2  False   True

In [15]:
df3_filled = df3.fillna({'Name': 'Unknown', 'Age': 0})
print(df3_filled)

      Name   Age
0     Raju  23.0
1  Unknown  25.0
2     Mina   0.0

In [16]:
df4 = pd.DataFrame({
    'City': ['Dhaka', 'Chittagong', 'Dhaka', 'Khulna'],
    'Sales': [250, 150, 200, 100]
})

grouped = df4.groupby('City').sum()
print(grouped)

            Sales
City
Chittagong    150
Dhaka         450
Khulna        100

In [17]:
# পড়া
df_csv = pd.read_csv('sample.csv')
print(df_csv.head())

# লেখা
df_csv.to_csv('output.csv', index=False)

      Name  Age       City
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35    Kolkata
3    David   28    Chennai
4      Eva   22  Bangalore

In [18]:
print(s.sum())

['Alice', 'Bob', 'Charlie', 25, 30, 35, 'Delhi', 'Mumbai', 'Kolkata']

In [19]:
data = {
    'City': ['Dhaka', 'Chittagong', 'Dhaka', 'Khulna'],
    'Sales': [250, 150, 200, 100]
}
df = pd.DataFrame(data)

print(df['Sales'].sum())

700

In [20]:
 
# First DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Score': [85, 90, 75]
})

# Merge on 'ID'
merged_df = pd.merge(df1, df2, on='ID', how='inner')
print(merged_df)

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [21]:
# First DataFrame
df_a = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Score': [85, 90]
})

# Second DataFrame
df_b = pd.DataFrame({
    'Name': ['Charlie', 'David'],
    'Score': [75, 88]
})

# Concatenate vertically
concat_df = pd.concat([df_a, df_b])
print(concat_df)

      Name  Score
0    Alice     85
1      Bob     90
0  Charlie     75
1    David     88